---
title: FilterOperatorAndTextString
classe: Autodesk.Revit.DB.FilterOperatorAndTextString
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FilterOperatorAndTextString

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String FilterOperatorStr { get; }` | `filterOperatorAndTextString.FilterOperatorStr` | String |
| `Boolean IsValidObject { get; }` | `filterOperatorAndTextString.IsValidObject` | Boolean |
| `ScheduleFilterType OperatorType { get; }` | `filterOperatorAndTextString.OperatorType` | ScheduleFilterType |
| `Void Dispose()` | `filterOperatorAndTextString.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```